GMarin_CV.org
#+TITLE: Home: Romania --- Github: [[https://github.com/gbrlmarn][github.com/gbrlmarn ---]] E-mail:[[mailto:gbrlmarn@proton.me][gbrlmarn@proton.me]]
#+AUTHOR: Gabriel Marin
#+OPTIONS: toc:nil num:nil
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [12pt,a4paper]

# Hide page number
#+LaTeX_HEADER: \pagenumbering{gobble}

# Setup packages to be used
#+LaTeX_HEADER: \usepackage{array, xcolor, bibentry}
#+LaTeX_HEADER: \usepackage[margin=2cm]{geometry}
#+LaTeX_HEADER: \usepackage{titlesec}
#+LaTeX_HEADER: \usepackage{titling}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \usepackage{blindtext}
#+LaTex_HEADER: \usepackage{setspace}

# Table aesthetics
#+LaTeX_HEADER: \definecolor{lightgray}{gray}{0.8}
#+LaTeX_HEADER: \newcolumntype{L}{>{\raggedleft}p{0.25\textwidth}}
#+LaTeX_HEADER: \newcolumntype{R}{p{0.78\textwidth}}
#+LaTex_HEADER: \newcolumntype{C}{p{0.2\textwidth}}
#+LaTeX_HEADER: \newcommand\VRule{\color{lightgray}\vrule width 0.5pt}
#+LaTeX_HEADER: \renewcommand{\hline}{}

# Indentation
#+LaTeX_HEADER: \setlength{\parindent}{0pt}

# Subtitles
#+LaTeX_HEADER: \titleformat{\section}{\LARGE\bfseries\scshape}{}{0em}{}[\titlerule]
#+LaTeX_HEADER: \titlespacing{\section}{0pt}{5pt}{5pt}

# Subtitles2
#+LaTeX_HEADER: \titleformat{\subsection}{\Large\bfseries\scshape}{}{0em}{}
#+LaTeX_HEADER: \titlespacing{\subsection}{0pt}{5pt}{5pt}

# Header
#+LaTeX_HEADER: \renewcommand{\maketitle}{\begin{center}{\LARGE\bfseries \theauthor } \vspace{5pt} \smallbreak \thetitle \end{center}}

# Hyperlinks
#+LaTeX_HEADER: \hypersetup{colorlinks=true, urlcolor=blue}

* Experience
#+ATTR_LATEX: :environment tabular :align {L!{\VRule}R}
|--------------------+---------------------------------------------------|
| from August 2022   | Software Developer, Luxoft                        |
| to Present         | - Developer wrapper over ZeroMQ library.          |
|--------------------+---------------------------------------------------|
| from October 2021  | Software Developer, Continental                   |
| to August 2022     | - Worked on XML parser and code generator.        |
|--------------------+---------------------------------------------------|
| from December 2019 | System Engineer, Ministry of Internal Affairs     |
| to October 2021    | - Automated software deployment using PowerShell. |
|--------------------+---------------------------------------------------|
| from August 2018   | IT Engineer, Ministry of Internal Affairs         |
| to December 2019   | - Managed database user access.                   |
|--------------------+---------------------------------------------------|

* Education
#+ATTR_LATEX: :environment tabular :align {L!{\VRule}R}
|-----------+----------------------------------------------------------|
| 2018-2020 | Master's Degree, Military Technical Academy, Bucharest   |
|           | Field: Telecommunications and Electronic Engineering     |
|           | Thesis: Platform for Wireless Security                   |
|-----------+----------------------------------------------------------|
| 2014-2018 | Bachelor's Degree, Military Technical Academy, Bucharest |
|           | Field: Telecommunications and Electronic Engineering     |
|           | Thesis: Beam-forming using MUSIC algorithhm              |
|-----------+----------------------------------------------------------|

* Skills
** Development
#+ATTR_LATEX: :environment tabular :align {L!{\VRule}R}
|--------------+----------------------------------------|
| ADVANCED     | C, Scheme                              |
|--------------+----------------------------------------|
| INTERMEDIATE | C++, Python, Clojure, Java, JavaScript |
|--------------+----------------------------------------|
| ELEMENTARY   | Elixir, Hy, Racket, Common Lisp        |
|--------------+----------------------------------------|
** Tools 
#+ATTR_LATEX: :environment tabular :align {L!{\VRule}R}
|--------------+--------------------------------------------|
| ADVANCED     | Linux, Git, Unix shell, Emacs              |
|--------------+--------------------------------------------|
| INTERMEDIATE | \LaTeX, Docker                             |
|--------------+--------------------------------------------|
| ELEMENTARY   | React, Django, SQL, NoSQL, Wireshark, Nmap |
|--------------+--------------------------------------------|

** Languages
#+ATTR_LATEX: :environment tabular :align CCCC
|------------+----------+------------+------------|
| English    | Romanian | Italian    | French     |
| Proficient | Native   | Elementary | Elementary |
|------------+----------+------------+------------|

** Certifications
   - [[https://www.freecodecamp.org/certification/fcc27d8d0fe-d4ec-4f51-8fe6-6166f68d948f/front-end-development-libraries][Front End Development Libraries]]
   - [[https://www.freecodecamp.org/certification/fcc27d8d0fe-d4ec-4f51-8fe6-6166f68d948f/javascript-algorithms-and-data-structures][JavaScript Algorithms and Data Structures]]


