GMarin_CV.tex
% Created 2023-02-19 Sun 23:10
% Intended LaTeX compiler: pdflatex
\documentclass[12pt,a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\pagenumbering{gobble}
\usepackage{array, xcolor, bibentry}
\usepackage[margin=2cm]{geometry}
\usepackage{titlesec}
\usepackage{titling}
\usepackage{hyperref}
\usepackage{blindtext}
\usepackage{setspace}
\definecolor{lightgray}{gray}{0.8}
\newcolumntype{L}{>{\raggedleft}p{0.25\textwidth}}
\newcolumntype{R}{p{0.78\textwidth}}
\newcolumntype{C}{p{0.2\textwidth}}
\newcommand\VRule{\color{lightgray}\vrule width 0.5pt}
\renewcommand{\hline}{}
\setlength{\parindent}{0pt}
\titleformat{\section}{\LARGE\bfseries\scshape}{}{0em}{}[\titlerule]
\titlespacing{\section}{0pt}{5pt}{5pt}
\titleformat{\subsection}{\Large\bfseries\scshape}{}{0em}{}
\titlespacing{\subsection}{0pt}{5pt}{5pt}
\renewcommand{\maketitle}{\begin{center}{\LARGE\bfseries \theauthor } \vspace{5pt} \smallbreak \thetitle \end{center}}
\hypersetup{colorlinks=true, urlcolor=blue}
\author{Gabriel Marin}
\date{\today}
\title{Home: Romania --- Github: \href{https://github.com/gbrlmarn}{github.com/gbrlmarn ---} E-mail:\href{mailto:gbrlmarn@proton.me}{gbrlmarn@proton.me}}
\hypersetup{
 pdfauthor={Gabriel Marin},
 pdftitle={Home: Romania --- Github: \href{https://github.com/gbrlmarn}{github.com/gbrlmarn ---} E-mail:\href{mailto:gbrlmarn@proton.me}{gbrlmarn@proton.me}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Experience}
\label{sec:orgf2357bc}
\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
from August 2022 & Software Developer, Luxoft\\
to Present & - Developer wrapper over ZeroMQ library.\\
\hline
from October 2021 & Software Developer, Continental\\
to August 2022 & - Worked on XML parser and code generator.\\
\hline
from December 2019 & System Engineer, Ministry of Internal Affairs\\
to October 2021 & - Automated software deployment using PowerShell.\\
\hline
from August 2018 & IT Engineer, Ministry of Internal Affairs\\
to December 2019 & - Managed database user access.\\
\hline
\end{tabular}
\end{center}

\section*{Education}
\label{sec:org47afc21}
\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
2018-2020 & Master's Degree, Military Technical Academy, Bucharest\\
 & Field: Telecommunications and Electronic Engineering\\
 & Thesis: Platform for Wireless Security\\
\hline
2014-2018 & Bachelor's Degree, Military Technical Academy, Bucharest\\
 & Field: Telecommunications and Electronic Engineering\\
 & Thesis: Beam-forming using MUSIC algorithhm\\
\hline
\end{tabular}
\end{center}

\section*{Skills}
\label{sec:orge326201}
\subsection*{Development}
\label{sec:orgcd7ee5a}
\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
ADVANCED & C, Scheme\\
\hline
INTERMEDIATE & C++, Python, Clojure, Java, JavaScript\\
\hline
ELEMENTARY & Elixir, Hy, Racket, Common Lisp\\
\hline
\end{tabular}
\end{center}
\subsection*{Tools}
\label{sec:orga64eda3}
\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
ADVANCED & Linux, Git, Unix shell, Emacs\\
\hline
INTERMEDIATE & \LaTeX, Docker\\
\hline
ELEMENTARY & React, Django, SQL, NoSQL, Wireshark, Nmap\\
\hline
\end{tabular}
\end{center}

\subsection*{Languages}
\label{sec:org3b82af7}
\begin{center}
\begin{tabular}{CCCC}
\hline
English & Romanian & Italian & French\\
Proficient & Native & Elementary & Elementary\\
\hline
\end{tabular}
\end{center}

\subsection*{Certifications}
\label{sec:org4d2e978}
\begin{itemize}
\item \href{https://www.freecodecamp.org/certification/fcc27d8d0fe-d4ec-4f51-8fe6-6166f68d948f/front-end-development-libraries}{Front End Development Libraries}
\item \href{https://www.freecodecamp.org/certification/fcc27d8d0fe-d4ec-4f51-8fe6-6166f68d948f/javascript-algorithms-and-data-structures}{JavaScript Algorithms and Data Structures}
\end{itemize}
\end{document}
